In [1]:
import numpy as np
import pandas as pd

In [23]:
array = np.arange(1,11)
index = 'a b c d e f g h i j '.split()
series = pd.Series(data=array,index=index)
series

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [24]:
series['a']

1

In [25]:
series['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [26]:
series.loc[['b','d']]

b    2
d    4
dtype: int64

In [27]:
series.iloc[1]

2

In [29]:
series.iloc[:2]

a    1
b    2
dtype: int64

In [33]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]],index=['a','b','c'],columns=['c1','c2','c3'])
df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

In [35]:
from sklearn.datasets import load_iris

In [40]:
iris = load_iris()
df = pd.DataFrame(data=iris.data,columns=iris.feature_names)
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [42]:
df = pd.read_csv('/home/igor-bond/Downloads/data.csv',encoding='shift-jis',nrows=500)
df.head()

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
0  2015/1/1      8.2      0.7         0.0         3.8
1  2015/1/2      7.9     -2.2         0.0         5.0
2  2015/1/3      8.9     -1.1         0.0         0.0
3  2015/1/4      9.3     -0.4         0.0         5.3
4  2015/1/5     12.9      1.3         0.0         2.5

In [46]:
#nrows is how many rows to read if 500 it meabs please read 500 rows

In [48]:
df.shape

(500, 5)

In [50]:
df = pd.read_csv('/home/igor-bond/Downloads/data.csv',encoding='shift-jis')
df.shape

(1827, 5)

In [51]:
df.describe()

           最高気温(℃)      最低気温(℃)   降水量の合計(mm)   平均雲量(10分比)
count  1827.000000  1827.000000  1827.000000  1827.000000
mean     20.867269    12.714833     4.548440     6.828681
std       8.014607     8.171153    13.625295     3.269057
min       3.500000    -4.000000     0.000000     0.000000
25%      13.700000     5.100000     0.000000     4.300000
50%      21.400000    13.300000     0.000000     7.800000
75%      27.300000    19.600000     2.000000    10.000000
max      39.000000    28.500000   209.500000    10.000000

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1827 entries, 0 to 1826
Data columns (total 5 columns):
年月日           1827 non-null object
最高気温(℃)       1827 non-null float64
最低気温(℃)       1827 non-null float64
降水量の合計(mm)    1827 non-null float64
平均雲量(10分比)    1827 non-null float64
dtypes: float64(4), object(1)
memory usage: 71.4+ KB

In [53]:
df.nunique()

年月日           1827
最高気温(℃)        319
最低気温(℃)        301
降水量の合計(mm)     113
平均雲量(10分比)      41
dtype: int64

In [55]:
df.isnull().head()

     年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
0  False    False    False       False       False
1  False    False    False       False       False
2  False    False    False       False       False
3  False    False    False       False       False
4  False    False    False       False       False

In [56]:
df.isnull().sum()

年月日           0
最高気温(℃)       0
最低気温(℃)       0
降水量の合計(mm)    0
平均雲量(10分比)    0
dtype: int64

In [59]:
df.index

RangeIndex(start=0, stop=1827, step=1)

In [60]:
df.columns

Index(['年月日', '最高気温(℃)', '最低気温(℃)', '降水量の合計(mm)', '平均雲量(10分比)'], dtype='object')

In [61]:
df.loc[0,['最高気温(℃)','降水量の合計(mm)']]

最高気温(℃)       8.2
降水量の合計(mm)      0
Name: 0, dtype: object

In [70]:
df.head() > 10

    年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
0  True    False    False       False       False
1  True    False    False       False       False
2  True    False    False       False       False
3  True    False    False       False       False
4  True     True    False       False       False

In [71]:
df[df > 10].head(10)

         年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
0   2015/1/1      NaN      NaN         NaN         NaN
1   2015/1/2      NaN      NaN         NaN         NaN
2   2015/1/3      NaN      NaN         NaN         NaN
3   2015/1/4      NaN      NaN         NaN         NaN
4   2015/1/5     12.9      NaN         NaN         NaN
5   2015/1/6     16.0      NaN         NaN         NaN
6   2015/1/7     10.2      NaN         NaN         NaN
7   2015/1/8     11.2      NaN         NaN         NaN
8   2015/1/9     11.0      NaN         NaN         NaN
9  2015/1/10     11.2      NaN         NaN         NaN

In [74]:
df['最高気温(℃)'].head() > 10

0    False
1    False
2    False
3    False
4     True
Name: 最高気温(℃), dtype: bool

In [79]:
df[df['最高気温(℃)'] > 10].head()

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
4  2015/1/5     12.9      1.3         0.0         2.5
5  2015/1/6     16.0      5.8         6.5         8.0
6  2015/1/7     10.2      3.0         0.0         4.8
7  2015/1/8     11.2      2.0         0.0         0.0
8  2015/1/9     11.0      3.5         0.0         0.0

In [82]:
df[(df['最高気温(℃)'] > 10) & (df['降水量の合計(mm)'] < 10 )].head()

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)
4  2015/1/5     12.9      1.3         0.0         2.5
5  2015/1/6     16.0      5.8         6.5         8.0
6  2015/1/7     10.2      3.0         0.0         4.8
7  2015/1/8     11.2      2.0         0.0         0.0
8  2015/1/9     11.0      3.5         0.0         0.0

In [85]:
df['new_column'] = df['最高気温(℃)'] + df['最低気温(℃)']
df.head()

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)  new_column
0  2015/1/1      8.2      0.7         0.0         3.8         8.9
1  2015/1/2      7.9     -2.2         0.0         5.0         5.7
2  2015/1/3      8.9     -1.1         0.0         0.0         7.8
3  2015/1/4      9.3     -0.4         0.0         5.3         8.9
4  2015/1/5     12.9      1.3         0.0         2.5        14.2

In [87]:
df.drop(columns=['平均雲量(10分比)'])
df.head()                          >>>>>>>>inplace == False

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  平均雲量(10分比)  new_column
0  2015/1/1      8.2      0.7         0.0         3.8         8.9
1  2015/1/2      7.9     -2.2         0.0         5.0         5.7
2  2015/1/3      8.9     -1.1         0.0         0.0         7.8
3  2015/1/4      9.3     -0.4         0.0         5.3         8.9
4  2015/1/5     12.9      1.3         0.0         2.5        14.2

In [88]:
df.drop(columns=['平均雲量(10分比)'],inplace=True)
df.head()

        年月日  最高気温(℃)  最低気温(℃)  降水量の合計(mm)  new_column
0  2015/1/1      8.2      0.7         0.0         8.9
1  2015/1/2      7.9     -2.2         0.0         5.7
2  2015/1/3      8.9     -1.1         0.0         7.8
3  2015/1/4      9.3     -0.4         0.0         8.9
4  2015/1/5     12.9      1.3         0.0        14.2

In [91]:
df = pd.DataFrame(data=[[1,2,3,np.nan,4],
                        [5,np.nan,6,np.nan,7],
                        [8,9,10,np.nan,11],
                        [12,np.nan,np.nan,np.nan,13],
                        [14,15.0,16.0,17.0,16]],
                  index='a b c d e'.split(),
                  columns='c1 c2 c3 c4 c5'.split())
df

   c1    c2    c3    c4  c5
a   1   2.0   3.0   NaN   4
b   5   NaN   6.0   NaN   7
c   8   9.0  10.0   NaN  11
d  12   NaN   NaN   NaN  13
e  14  15.0  16.0  17.0  16

In [92]:
df.dropna()

   c1    c2    c3    c4  c5
e  14  15.0  16.0  17.0  16

In [94]:
df['c2'].dropna()

a     2.0
c     9.0
e    15.0
Name: c2, dtype: float64

In [95]:
df['c2'].isnull()

a    False
b     True
c    False
d     True
e    False
Name: c2, dtype: bool

In [96]:
df[df['c2'].isnull() == False]

   c1    c2    c3    c4  c5
a   1   2.0   3.0   NaN   4
c   8   9.0  10.0   NaN  11
e  14  15.0  16.0  17.0  16

In [97]:
df.dropna(thresh=3)

   c1    c2    c3    c4  c5
a   1   2.0   3.0   NaN   4
b   5   NaN   6.0   NaN   7
c   8   9.0  10.0   NaN  11
e  14  15.0  16.0  17.0  16

In [99]:
df.dropna(thresh=3,axis=1)

   c1    c2    c3  c5
a   1   2.0   3.0   4
b   5   NaN   6.0   7
c   8   9.0  10.0  11
d  12   NaN   NaN  13
e  14  15.0  16.0  16

In [104]:
df['c2'].fillna(df['c2'].mean())

a     2.000000
b     8.666667
c     9.000000
d     8.666667
e    15.000000
Name: c2, dtype: float64

In [101]:
df.fillna(df.mean())

   c1         c2     c3    c4  c5
a   1   2.000000   3.00  17.0   4
b   5   8.666667   6.00  17.0   7
c   8   9.000000  10.00  17.0  11
d  12   8.666667   8.75  17.0  13
e  14  15.000000  16.00  17.0  16

In [107]:
df = pd.DataFrame({'c1':['a','a','a','b','b','c',np.nan],
                    'c2':[20,50,60,80,100,30,50],
                  'c3':[40,200,100,500,40,200,40]})
df

    c1   c2   c3
0    a   20   40
1    a   50  200
2    a   60  100
3    b   80  500
4    b  100   40
5    c   30  200
6  NaN   50   40

In [108]:
df['c1'].value_counts()

a    3
b    2
c    1
Name: c1, dtype: int64

In [109]:
df[df['c1'] == 'a']

  c1  c2   c3
0  a  20   40
1  a  50  200
2  a  60  100

In [110]:
df['c1'].fillna(df['c1'].mode()[0])#saihinnti

0    a
1    a
2    a
3    b
4    b
5    c
6    a
Name: c1, dtype: object

In [112]:
df #>>>>>>not updated

    c1   c2   c3
0    a   20   40
1    a   50  200
2    a   60  100
3    b   80  500
4    b  100   40
5    c   30  200
6  NaN   50   40

In [117]:
df['c1'] = df['c1'].fillna(df['c1'].mode()[0])
df

  c1   c2   c3
0  a   20   40
1  a   50  200
2  a   60  100
3  b   80  500
4  b  100   40
5  c   30  200
6  a   50   40

In [119]:
round(df['c1'].value_counts() / len(df),2)

a    0.57
b    0.29
c    0.14
Name: c1, dtype: float64

In [120]:
df.groupby('c1')

In [121]:
df.groupby('c1').sum()

     c2   c3
c1
a   180  380
b   180  540
c    30  200

In [122]:
df.groupby('c1').mean()

    c2   c3
c1
a   45   95
b   90  270
c   30  200

In [125]:
df1 = pd.DataFrame(data=np.random.randn(5,5),index=['a','b','c','d','e'])
df2 = pd.DataFrame(data=np.random.randn(5,5),index=['f','g','h','i','j'])

In [126]:
df1

          0         1         2         3         4
a -0.713818 -1.779538 -0.222817  0.007058 -0.726435
b  0.419543 -0.044108  0.044665 -0.673206  0.067438
c  0.510620  0.466750 -1.209409  0.993400  0.636023
d  0.535146  0.542097 -0.698017 -1.218582  0.069223
e  1.331518  0.555149 -0.516987  1.164183  1.095704

In [127]:
df2

          0         1         2         3         4
f  0.112892 -0.834697  0.340202 -1.691763  0.961958
g -1.417227  1.329480  0.440339  2.009619 -0.030304
h  0.305882  0.895032  1.393821  0.156368 -0.803333
i  0.182414  0.277938 -0.195842  0.326882 -0.906031
j  0.964134 -0.094306  1.373897  0.145048  0.751768

In [129]:
pd.concat([df1,df2])

          0         1         2         3         4
a -0.713818 -1.779538 -0.222817  0.007058 -0.726435
b  0.419543 -0.044108  0.044665 -0.673206  0.067438
c  0.510620  0.466750 -1.209409  0.993400  0.636023
d  0.535146  0.542097 -0.698017 -1.218582  0.069223
e  1.331518  0.555149 -0.516987  1.164183  1.095704
f  0.112892 -0.834697  0.340202 -1.691763  0.961958
g -1.417227  1.329480  0.440339  2.009619 -0.030304
h  0.305882  0.895032  1.393821  0.156368 -0.803333
i  0.182414  0.277938 -0.195842  0.326882 -0.906031
j  0.964134 -0.094306  1.373897  0.145048  0.751768

In [132]:
pd.concat([df1,df2],axis=1)

,0,1,2,3,4,0,1,2,3,4
a,-0.713818,-1.779538,-0.222817,0.007058,-0.726435,NaN,NaN,NaN,NaN,NaN
b,0.419543,-0.044108,0.044665,-0.673206,0.067438,NaN,NaN,NaN,NaN,NaN
c,0.510620,0.466750,-1.209409,0.993400,0.636023,NaN,NaN,NaN,NaN,NaN
d,0.535146,0.542097,-0.698017,-1.218582,0.069223,NaN,NaN,NaN,NaN,NaN
e,1.331518,0.555149,-0.516987,1.164183,1.095704,NaN,NaN,NaN,NaN,NaN
f,NaN,NaN,NaN,NaN,NaN,0.112892,-0.834697,0.340202,-1.691763,0.961958
g,NaN,NaN,NaN,NaN,NaN,-1.417227,1.329480,0.440339,2.009619,-0.030304
h,NaN,NaN,NaN,NaN,NaN,0.305882,0.895032,1.393821,0.156368,-0.803333
i,NaN,NaN,NaN,NaN,NaN,0.182414,0.277938,-0.195842,0.326882,-0.906031
j,NaN,NaN,NaN,NaN,NaN,0.964134,-0.094306,1.373897,0.145048,0.751768

In [141]:
def square(x):
    return x ** 2

In [143]:
df1[0].apply(square)

a    0.509535
b    0.176016
c    0.260733
d    0.286381
e    1.772940
Name: 0, dtype: float64

In [144]:
def add(x,y):
    return x + y

In [146]:
add(df1[0],df1[1])

a   -2.493355
b    0.375435
c    0.977370
d    1.077243
e    1.886667
dtype: float64

In [147]:
def add(df):
    return df[0] + df[1]

In [148]:
df1.apply(add,axis=1)

a   -2.493355
b    0.375435
c    0.977370
d    1.077243
e    1.886667
dtype: float64